In [3]:
#Create a dataframe, save it as a CSV file ,set index as random
import numpy as np
import pandas as pd
df=pd.DataFrame(np.random.randn(4, 4), columns = list('ABCD'))
df.to_csv('example.csv', index=False)

In [6]:
#2.Create dataframe,the merge it with a new column
import pandas as pd 
 
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Princi', 'Gaurav'], 
        'Age':[27, 24, 22], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad'], 
        'Qualification':['Msc', 'MA', 'MCA']} 
   
# Define a dictionary containing employee data 
data2 = {'Name':['Abhi', 'Ayushi', 'Dhiraj'], 
        'Age':[17, 14, 12], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad'], 
        'Qualification':['Btech', 'B.A', 'Bcom']} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2])
 
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=[3,4, 5])
 
print(df, "\n\n", df1)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA

      Name  Age    Address Qualification
3    Abhi   17     Nagpur         Btech
4  Ayushi   14     Kanpur           B.A
5  Dhiraj   12  Allahabad          Bcom

In [5]:
# using a .concat() method
frames = [df, df1]
 
res1 = pd.concat(frames)
res1

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons